const answers = '["ЗОЛУШКА","ВВЕРХ","БЭТМЕН","КОРОЛЬ ЛЕВ","ТОР","ТИТАНИК","ЗВЕРОПОЛИС","МАТРИЦА","ВАЛЛИ","ПИЛА","КУНГ-ФУ ПАНДА","ОНО","ЗВОНОК","ВОЛЬТ","ТРАНСФОРМЕРЫ","ИНДИАНА ДЖОНС","ФОРРЕСТ ГАМП","РАПУНЦЕЛЬ","КИНГ-КОНГ","ЛЕДНИКОВЫЙ ПЕРИОД","ФЛЭШ","МАСКА","ШЕРЛОК ХОЛМС","ПИАНИСТ","СИМПСОНЫ","КОТ В САПОГАХ","ЮЖНЫЙ ПАРК","АВАТАР","МОЛЧАНИЕ ЯГНЯТ","ШРЕК","ЛЕОН","ЧУЖОЙ","В ПОИСКАХ НЕМО","ТРОЯ","ЛЮДИ В ЧЕРНОМ","ОДИН ДОМА","МИНЬОНЫ","РОБОКОП","ПАРФЮМЕР","ОХОТНИКИ ЗА ПРИВЕДЕНИЯМИ","101 ДАЛМАТИНЕЦ","ГОЛОДНЫЕ ИГРЫ","РОККИ","ВИННИ ПУХ","ХАТИКО","ЧЕРНЫЙ ЛЕБЕДЬ","ТАЧКИ","ОТРЯД САМОУБИЙЦ","НАЗАД В БУДУЩЕЕ","ВЛАСТЕЛИН КОЛЕЦ","РУСАЛОЧКА","НАЧАЛО","ШОУ ТРУМАНА","КОРПОРАЦИЯ МОНСТР","ГАРРИ ПОТТЕР","ТРАССА 60","ХИТМЭН","ХАЛК","РАТАТУЙ","ЧЕРЕПАШКИ НИНЗДЯ","БОРАТ","ТРЕТИЙ ЛИШНИЙ","АМЕРИКАНСКИЙ ПИР","ЛЮДИ ИКС","КАЗИНО","ЛА-ЛА ЛЕНД","ФОРСАЖ","МОАНА","КРИМИНАЛЬНОЕ ЧТИ","СОЦИАЛЬНАЯ СЕТЬ","ЗЕЛЕНЫЙ ФОНАРЬ","ИЗГОЙ","КОШМАР ПЕРЕД РОЖ","СУПЕРМЕН","КРАСАВИЦА И ЧУДОВИЩЕ","ГУБКА БОБ","НА ГРЕБНЕ ВОЛНЫ","ГОРБАТАЯ ГОРА","ДЬЯВОЛ НОСИТ ПРА","ПЕРЛ-ХАРБОР","КОТОПЕС","ФУТУРАМИ","ТЕРМИНАТОР","МАЛЕНЬКИЙ ПРИНЦ","СПЯЩАЯ КРАСАВИЦА","ЗВЕЗДНЫЕ ВОЙНЫ","ПРИВИДЕНИЕ","ЗЕЛЕНАЯ МИЛЯ","БЕЛОСНЕЖКА","ОДЕРЖИМОСТЬ","ГОЛОВОЛОМКА","МАРСИАНИН","ЗОРРО","ЧЕЛОВЕК-ПАУК","ТАКСИСТ","ИСЧЕЗНУВШАЯ","НИНДЗЯГО","СУМЕРКИ","ПОКЕМОН","ЕШЬ, МОЛИСЬ, ЛЮБИ","СТРАЖИ ГАЛАКТИКИ","ЗОДИАК","МАДАГАСКАР","ОБЛАЧНЫЙ АТЛАС","ПСИХО","ТОМ И ДЖЕРРИ","ЖИЗНЬ ПИ","ГРАВИТАЦИЯ","ДЖЕЙМС БОНД","ПОМНИ","БЭМБИ","КРАСОТА ПО-АМЕРИК","КАСПЕР","ХОЛОДНОЕ СЕРДЦЕ","НОЧЬ В МУЗЕЕ","ИГРА ПРЕСТОЛОВ","ИСТОРИЯ ИГРУШЕК","ПИРАНЬИ","МАППЕТЫ","ВОКРУГ СВЕТА ЗА 80","СИЯНИЕ","ВРЕМЯ ПРИКЛЮЧЕН","ХРАБРОЕ СЕРДЦЕ","ЗАВОДНОЙ АПЕЛЬСИН","ТРУП НЕВЕСТЫ","ПИКСЕЛИ","ЧУДО НА ГУДЗОНЕ","АЛАДДИН","КРЕСТНЫЙ ОТЕЦ","ДЕНЬ СУРКА","ЧЕЛОВЕК-МУРАВЕЙ","БОЛЬШОЙ","СЕМЬ САМУРАЕВ","КАПИТАН АМЕРИКА","УБИТЬ БИЛЛА","УТИНЫЕ ИСТОРИИ","ЧУДО-ЖЕНЩИНА","БОСС-МОЛОКОСОС","ХРОНИКИ НАРНИИ","БЕШЕНЫЕ ПСЫ","ГОРОД ГЕРОЕВ","ПРИЗРАЧНЫЙ ГОНЩ","ОСВОБОДИТЕ ВИЛЛИ","РИК И МОРТИ","БОЛЬШОЙ ЛЕБОВСКИ","ПЛАНЕТА ОБЕЗЬЯН","ПИНОККИО","БЕЗУМНЫЙ МАКС","ДЖАНГО ОСВОБОЖД","ПЛОХОЙ САНТА","РОБИН ГУД","РАЛЬФ","ДОКТОР ХАУС","ТРИ МУШКЕТЁРА","ДРУЗЬЯ","КРИК","ЖЕНЩИНА КОШКА","ИНТЕРСТЕЛЛАР","ГРАВИТИ ФОЛЗ","ЗВЕЗДНЫЙ ПУТЬ","ГАРФИЛД","ИНОПЛАНЕТЯНИН","ЭДДИ ОРЕЛ","БЕССЛАВНЫЕ УБЛЮДК","МАЛЬЧИШНИК В ВЕГАСЕ","СЕМЕЙКА АДДАМС","КОСМИЧЕСКИЙ ДЖЕМ","ПРИБЫТИЕ","АЛИСА В СТРАНЕ ЧУД","АИСТЫ","ЧУДАКИ","СМУРФИКИ","ПОБЕГ ИЗ ШОУШЕНКА","КАК ПРИРУЧИТЬ ДРАК","ГЛАДИАТОР","СЕМЬ","ДЖУНИОР","ПАРК ЮРСКОГО ПЕРИ","ДОКТОР СТРЕНДЖ","ХЕЛЛБОЙ","КРУПНАЯ РЫБА","ОМЕРЗИТЕЛЬНАЯ 8-КА","ТАРЗАН","ПИРАТЫ КАРИБСКОГО","БОЛЬШОЙ КУШ","МОНСТРО","ТЕЛЕФОННАЯ БУДКА","ХОДЯЧИЕ МЕРТВЕЦЫ","ПЛАНЕТА КА-ПЭКС","МАЧЕТЕ","ПОСЛЕ ПРОЧТЕНИЯ","СТАРИКАМ ТУТ НЕ МЕ","ГРЕМЛИНЫ","ПРОГУЛКА","ЗНАКИ","ХРАНИТЕЛИ","МЕЧ КОРОЛЯ АРТУРА","КИНГСМЕН","МАЛЫШ НА ДРАЙВЕ","КАРТОЧНЫЙ ДОМИК","ТАЙНА КОКО","ДАМБО","ВРЕМЯ","БЕЗ ЛИЦА","ХРАБРАЯ СЕРДЦЕМ","ЧЕЛОВЕК НЕВИДИМКА","СКАЛА","БЕГУЩИЙ ПО ЛЕЗВИЮ","КНИГА ДЖУНГЛЕЙ","ВОЗДУШНАЯ ТЮРЬМА","МУХА","РОЗОВАЯ ПАНТЕРА","ВОДНЫЙ МИР","УНЕСЁННЫЙ ВЕТРОМ","АВИАТОР","ЩЕЛКУНЧИК","ЭЛЬФ","ФЛАББЕР","ЛОГАН","ЗВЕРОПОЙ","САЙЛЕНТ-ХИЛЛ","ЧЕЛОВЕК-СЛОН","СКУБИ-ДУ","ЧЕЛЮСТИ","СОКРОВИЩЕ НАЦИИ"]';
document.addEventListener("keydown", (event) => {
  let currentNumber = location.href.match(/.*\/(\d+)\.html/i)[1];
  if (event.keyCode === 39 || event.keyCode === 37) {

    location.href = location.href.replace(currentNumber + ".html", String(Number(currentNumber) + (event.keyCode === 39 ? 1 : -1)) + ".html");

    return;
  }
  if (event.keyCode === 40 || event.keyCode === 38) {
    let x = localStorage.getItem('x');
    if (typeof x !== 'string') {
      x = 100;
    }

    x = Number(x) + (event.keyCode === 38 ? -1 : 1);

    localStorage.setItem('x', x);
    document.body.style = `--x: ${x}`;

  }
  if (event.keyCode === 32) {
    alert(JSON.parse(answers)[currentNumber - 1]);
  }
});
document.addEventListener('DOMContentLoaded', () => {
  let x = localStorage.getItem('x');
  if (typeof x !== 'string') {
    x = 100;
  }
  document.body.style = `--x: ${x}`;
});